VFS-13200 Rework documentation
